// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
const numMin = (a,b,c)=>{
    if(a<b && a<c){
        console.log(a);
    }
    if(b<c && b<a){
        console.log(b);
    }
    if(c<a && c<b){
        console.log(c);
    }
}
numMin(100,200,50);

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
const numMax = (a,b,c)=>{
    if(a>b && a>c){
        console.log(a);
    }
    if(b>c && b>a){
        console.log(b);
    }
    if(c>a && c>b){
        console.log(c);
    }
}
numMax(100,20,50);

// - створити функцію яка повертає найбільше число з масиву
const maxArrNum =(arr)=>{
    min = arr[0];
  max = min;
  for (i = 1; i < arr.length; ++i) {
      if (arr[i] > max) max = arr[i];
      if (arr[i] < min) min = arr[i];
  }
  return max;
}
const arrruius = [1,5,7,45,2,5,46747];
maxArrNum(arrruius);
console.log(maxArrNum(arrruius));

// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.



// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, 
// а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. 
// limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
