// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
let arr = [111,555,222,333,444, 'dfdf','dfdswer','dfwertwe','werwerwe','ffeer', true,false];
console.log(arr);

// Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let arrEmp = [];
arrEmp[0]= 15;
arrEmp[1]= 'ffff';
arrEmp[2]= true;
arrEmp[3]= false;
console.log(arrEmp);

// - є масив
let arr3 = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
let i = 0;
while (i < arr3.length) {
    console.log(arr3[i]);
    i++;
}

//     2. перебрати його циклом for
for (const number of arr3) {
    console.log(number);
}

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
let d = 0;
while (d < arr3.length) {
    if (d%2!==0)
        console.log(arr3[d]);
    d++;
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
for (const number1 of arr3) {
    if (number1%2!==0)
        console.log(number1);
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення
let b = 0;
while (b < arr3.length) {
    if (b%2===0)
        console.log(arr3[b]);
    b++;
}

// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед